---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilySegmentPattern
source: html/be3fe3e5-8d7d-0766-cd6d-5ac06866c079.htm
---
# Autodesk.Revit.DB.GroupTypeId.RailingSystemFamilySegmentPattern Property

Segment Pattern (default).

## Syntax (C#)
```csharp
public static ForgeTypeId RailingSystemFamilySegmentPattern { get; }
```